//如果要获取主机信息，记得把 hostspecific 设置成true



//导入命名空间组件













//引入我们的公共模板文件

//引入命名空间









//定义我们的输出文件夹




//--------------------------------------------------------------------
//     此代码由T4模板自动生成
//	   生成时间 2019-03-14 17:35:43 
//     对此文件的更改可能会导致不正确的行为，并且如果重新生成代码，这些更改将会丢失。
//--------------------------------------------------------------------

  
using System;
namespace Blog.Core.FrameWork.Entity
{	
	/// <summary>
	/// Test
	/// </summary>	
	public class Test//可以在这里加上基类等
	{
	//将全部字段遍历出来

	  public int ID { get; set; }

	  public string NA { get; set; }
 
    }
}
//如果为空，表示要将整个数据库都生成出来
 

